---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.GreenBuilding
source: html/3fb69c21-df71-cd80-f190-d3d47e6f6f65.htm
---
# Autodesk.Revit.DB.GroupTypeId.GreenBuilding Property

Green Building Properties.

## Syntax (C#)
```csharp
public static ForgeTypeId GreenBuilding { get; }
```